URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "K1iWYJngqUAO0bbowpIt9Q"], ["LIMIT", 1]]
---
    def self.random_code
        code= SecureRandom.urlsafe_base64

        while ShortenedUrl.exists?(short_url: code) == true

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["long_url", "www.google.com"], ["short_url", "K1iWYJngqUAO0bbowpIt9Q"], ["user_id", 5]]
---
    def self.new!(user_obj, long_url)
        ShortenedUrl.create!(user_id: user_obj.id,
            long_url: long_url,
            short_url: self.random_code)