URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "short_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["short_url_id", 2], ["created_at", "2021-07-29 06:30:32.897328"], ["updated_at", "2021-07-29 06:30:32.897328"]]
---
    def self.record_visit!(user, shortened_url)
        Visit.create!(short_url_id: shortened_url.id, user_id: user.id)